
-- Заполнение статуса
-- DESC status;
INSERT INTO status (name, deskription) VALUES
  ('Работает', 'Статус рабочего'),
  ('В отпуске', 'Статус рабочего'),
  ('Уволен', 'Статус рабочего'),
  ('На больничном', 'Статус рабочего'),
  ('В работе', 'Статус маршрутного паспорта'),
  ('Выполнен', 'Статус маршрутного паспорта'),
  ('Заморожен', 'Статус маршрутного паспорта'),
  ('В рабочем состоянии', 'Статус оборудования'),
  ('На ремонте', 'Статус оборудования'),
  ('Проводится тех обслуживание', 'Статус оборудования'),
  ('Списан', 'Статус оборудования'),
  ('Работоспособно', 'Статус рабочего места'),
  ('Реконструкция', 'Статус рабочего места'),
  ('Закрыто', 'Статус рабочего места'),
  ('В работе', 'Статус инструмента'),
  ('На складе', 'Статус инструмента'),
  ('Списан', 'Статус инструмента');
  
SELECT * FROM status;

-- заполнение таблицы рабочие
 
DESC workers;
INSERT INTO workers (first_name, last_name, patronymic, gender, adress, prize, experience, status_id, birthday_at) VALUES
  ('Алексей', 'Алексеев', 'Алексеевич', 'm', 'Москва', '10000', '3', 1, '1978-10-05' ),
  ('Михаил', 'Михайлов', 'Михайлович', 'm', 'Серпухов', '20000', '5', 2, '1995-10-05' ),
  ('Сергей', 'Сергеев', 'Сергеевич', 'm', 'Тула', '15000', '6', 3, '2006-10-05' ),
  ('Петр', 'Петров', 'Петрович', 'm', 'Москва', '11000', '3', 4, '1956-10-05' ),
  ('Андрей', 'Шубин', 'Сергеевич', 'm', 'Москва', '10000', '6', 1, '1989-07-01' ),
  ('Андрей', 'Андреев', 'Андреевич', 'm', 'Москва', '18000', '8', 2, '1999-10-05' ),
  ('Игорь', 'Игоров', 'Игоревич', 'm', 'Москва', '11000', '9', 3, '1995-10-05' ),
  ('Василий', 'Васильев', 'Васильевич', 'm', 'Москва', '10040', '5', 4, '1990-11-05' ),
  ('Игнат', 'Игнатьев', 'Игнатьевич', 'm', 'Благовещенск', '10200', '2', 1, '1990-11-05' ),
  ('Алексей', 'Алексеев', 'Алексеевич', 'm', 'Москва', '16000', '4', 2, '1990-06-05' ),
  ('Ирина', 'Иринова', 'Ириновна', 'f', 'Москва', '11000', '4', 3, '1990-05-05' ),
  ('Лена', 'Ленина', 'Ленина', 'f', 'Ростов', '17000', '2', 4, '1990-10-05' ),
  ('Ксения', 'Ксенова', 'Ксеньевна', 'f', 'Москва', '16000', '1', 1, '1990-10-05' ),
  ('Виктория', 'Виктор', 'Викториевна', 'f', 'Москва', '12000', '14', 2, '1990-10-05' ),
  ('Светлана', 'Светланова', 'Светлановна', 'f', 'Москва', '18000', '2', 3, '1990-10-05' ),
  ('Дарья', 'Дашина', 'Дарьевна', 'f', 'Екатеринбург', '12000', '5', 4, '1990-10-05' ),
  ('Лидия', 'Лидова', 'Лидиевна', 'f', 'Москва', '12300', '3', 1, '1990-10-05' ),
  ('Ольга', 'Ольгина', 'Ольгиевна', 'f', 'Москва', '14300', '4', 2, '1990-10-05' ),
  ('Наталия', 'Наталь', 'Натальевна', 'f', 'Москва', '11000', '2', 3, '1990-10-05' ),
  ('Василиса', 'Васина', 'Василисовна', 'f', 'Москва', '16000', '6', 4, '1990-10-05' );
  
SELECT * FROM workers;


-- Должности
DESC post;

INSERT INTO post (name, responsibilities, salary) VALUES
  ('Генеральный директор', 'Управление всем', '200000'),
  ('Начальник производства', 'Ответственный по производству(мне очень не хочется закапыватся и прописывать все обязанности каждого)', '100000'),
  ('Начальник ОТК', 'мне очень не хочется закапыватся и прописывать все обязанности каждого', '100000'),
  ('Зам начальника производства', 'мне очень не хочется закапыватся и прописывать все обязанности каждого', '70000'),
  ('Мастер на производстве', 'мне очень не хочется закапыватся и прописывать все обязанности каждого', '70000'),
  ('Слесарь', 'мне очень не хочется закапыватся и прописывать все обязанности каждого', '50000'),
  ('Оператор ЧПУ', 'мне очень не хочется закапыватся и прописывать все обязанности каждого', '65000'),
  ('Контролер ОТК', 'мне очень не хочется закапыватся и прописывать все обязанности каждого', '100000'),
  ('Шлифовщик', 'мне очень не хочется закапыватся и прописывать все обязанности каждого', '56000'),
  ('Наладчик ЧПУ', 'мне очень не хочется закапыватся и прописывать все обязанности каждого', '80000'),
  ('Программист ЧПУ', 'мне очень не хочется закапыватся и прописывать все обязанности каждого', '80000'),
  ('Главный конструктор', 'мне очень не хочется закапыватся и прописывать все обязанности каждого', '100000'),
  ('Бухгалтер', 'мне очень не хочется закапыватся и прописывать все обязанности каждого', '100000');
  
SELECT * FROM post;

-- Рабочие и должности
DESC worker_post;

INSERT INTO worker_post (worker_id, post_id) VALUES
  (1, 1),
  (2, 2),
  (3, 3),
  (4, 4),
  (5, 7),
  (5, 10),
  (5, 11),
  (6, 5),
  (7, 6),
  (8, 8),
  (9, 9),
  (10, 12),
  (11, 13),
  (12, 6),
  (13, 6),
  (14, 9),
  (15, 7),
  (16, 7),
  (18, 7),
  (19, 7),
  (20, 7);
  
SELECT * FROM worker_post;

-- заполнение отделов

DESC branch;

INSERT INTO branch (name) VALUES
  ('ОТК'),
  ('ИТР'),
  ('Слесарная мастерская'),
  ('Шлифовальная мастерская'),
  ('Токарная группа'),
  ('Фрезерная группа'),
  ('Склад');
  
SELECT * FROM branch;


-- заполнение таблицы с оборудованием
DESC equipment;

INSERT INTO equipment (name, deskription, those_service, status_equipment_id) VALUES
  ('310', 'токарный станок', '2025-10-05', 8),
  ('510', 'токарный станок', '2025-10-05', 8),
  ('120', 'фрезерный', '2025-10-05', 8),
  ('KGM', 'координатно измерительный станок', '2025-10-05', 8),
  ('VIM', 'видио измерительный станок', '2025-10-05', 8),
  ('SH', 'шлифовальный станок', '2025-10-05', 8),
  ('hs', 'шлифовально-полировальны станок', '2025-10-05', 8),
  ('echo', 'фрезерный', '2025-10-05', 8),
  ('p2', 'компьютер', '2025-10-05', 8);
  
SELECT * FROM equipment;

-- заполняем инструмент

DESC tool;

INSERT INTO tool (name, status_tool_id, deskription) VALUES
  ('SUNDVIK D10', 15, 'фреза D10'),
  ('SUNDVIK D8', 15, 'фреза D8'),
  ('SUNDVIK D6', 16, 'фреза D6'),
  ('SUNDVIK D4', 16, 'фреза D4'),
  ('SUNDVIK R02', 15, 'пластина R02'),
  ('SUNDVIK R04', 15, 'пластина R04'),
  ('SUNDVIK R06', 16, 'пластина R06'),
  ('SUNDVIK R08', 16, 'пластина R08');
  
SELECT * FROM tool;

-- рабочее место

DESC workplace;

INSERT INTO workplace (name, those_service, status_workplace_id, branch_id, equipment_id) VALUES
  ('токарный участок 1', '2025-10-05', 12, 5, 1 ),
  ('токарный участок 2', '2025-10-05', 12, 5, 2 ),
  ('фрезерный участок', '2025-10-05', 12, 6, 3 ),
  ('ОТК KGM', '2025-12-30', 12, 1, 4 ),
  ('ОТК VIM', '2025-12-30', 13, 1, 5 ),
  ('Слесарка ', '2025-12-30', 12, 3, 6 ),
  ('Шлифовка', '2025-12-30', 12, 4, 7 ),
  ('фрезерная группа', '2025-12-30', 12, 6, 8 ),
  ('Склад', '2025-12-30', 12, 7, 9 );
  
SELECT * FROM workplace;

DESC tool_workplace ;
INSERT INTO tool_workplace (workplace_id, tool_id) VALUES
  (1, 1),
  (2, 2),
  (3, 4),
  (9, 3),
  (9, 5),
  (9, 6),
  (9, 7),
  (9, 8);
SELECT * FROM tool_workplace;

-- заполняем таблицу аттестации и ее типы
DESC val_type ;

INSERT INTO val_type (name) VALUES
  ('Аттестован на работу'),
  ('Аттестован на наладку'),
  ('Аттестован на написание программ'),
  ('Аттестован на тех обслуживание'),
  ('Аттестация провалена');

SELECT * FROM val_type;


DESC validation;

INSERT INTO validation (val_type_id, workplace_id, worker_val_id) VALUES
  (1, 1, 2),
  (1, 2, 2),
  (1, 3, 2),
  (1, 4, 2),
  (1, 5, 2),
  (1, 6, 2),
  (1, 7, 2),
  (1, 8, 2),
  (2, 1, 2),
  (2, 2, 2),
  (2, 3, 2),
  (2, 4, 2),
  (2, 5, 2),
  (2, 6, 2),
  (2, 7, 2),
  (2, 8, 2);

DESC worker_validation ;
INSERT INTO worker_validation (worker_id, validation_id) VALUES
  (5, 1),
  (5, 2),
  (5, 4),
  (15, 3),
  (16, 5),
  (18, 6),
  (19, 7),
  (20, 8);
SELECT * FROM worker_validation ;



SELECT id, name, deskription FROM status;
SELECT * FROM branch b ;
SELECT * FROM equipment e ;
SELECT * FROM workplace;
-- материал, и поставщики всего и вся

DESC material;
INSERT INTO material (name, deskription, forma, amount) VALUES
  ('VT-6', 'Титановый сплав', 'пруток  метры','10'),
  ('VT-4', 'Титановый сплав', 'пруток  метры','10'),
  ('VT-1', 'Титановый сплав', 'колокол  шт','10'),
  ('12х18н10т', 'Нержавейка', 'пруток  метры','5'),
  ('херулен', 'полимер', 'пруток метры','20'),
  ('фторопласт', 'полимер', 'пруток метры','20');
SELECT * FROM material;

DESC provider;

INSERT INTO provider (name, adress, deskription) VALUES
  ('DMGGGG', 'Москва', 'Поставщик станков'),
  ('SUNDVIKKKK', 'Москва', 'Поставщик режущего инструмента'),
  ('VIDIAAAA', 'Москва', 'Поставщик режущего инструмента'),
  ('Материал', 'Москва', 'Поставщик материалов');

SELECT * FROM provider;

DESC provider_material;

INSERT INTO provider_material (provider_id, material_id, price) VALUES
  (4, 1, '1000'),
  (4, 2, '2000'),
  (4, 4, '500'),
  (4, 3, '2000'),
  (4, 5, '1000'),
  (4, 6, '5000');
 
 SELECT * FROM provider_material;

DESC provider_equipment;

INSERT INTO provider_equipment (provider_id, equipment_id, price) VALUES
  (1, 1, '1000'),
  (1, 2, '2000'),
  (1, 4, '500'),
  (1, 3, '2000'),
  (1, 5, '1000'),
  (1, 6, '5000'),
  (1, 7, '2000'),
  (1, 8, '1000'),
  (1, 9, '5000');
 
 SELECT * FROM provider_equipment;

SELECT * FROM tool ;
DESC provider_tool ;

INSERT INTO provider_tool (provider_id, tool_id, price) VALUES
  (2, 1, '1000'),
  (2, 2, '2000'),
  (2, 4, '500'),
  (2, 3, '2000'),
  (3, 5, '1000'),
  (3, 6, '5000'),
  (3, 7, '2000'),
  (3, 8, '1000');
 
 SELECT * FROM provider_tool;

-- техзадания и их типы

DESC specification_type;

INSERT INTO specification_type (name) VALUES
  ('Изготовление'),
  ('Разработка технологии'),
  ('Разработка программы'),
  ('Разработка конструкции');

SELECT * FROM specification_type;

DESC specification;

INSERT INTO specification (name, type_id, deskription) VALUES
  ('Изготовление изделия №55001-04', 1, 'Задание на изготовление чашки бесцементной фиксации 4того типа размера'),
  ('Разработка конструкции изделия 55001-04', 4, 'Задание на разработку'),
  ('Разработка технологии на изделия 55001-04', 2, 'Задание на разработку технологии'),
  ('Разработка программы на изготовление изделия 55001-04', 3, 'Задание на разработку программы');

SELECT * FROM specification;


-- ЕСКД

DESC eskd;

INSERT INTO eskd (name, filename, filename_doc, tz_eskd_id, workers_razr_eskd_id, workers_prov_eskd_id, workers_utv_eskd_id, material_id, metadata) VALUES
  ('55001-04', 'https://www', 'https://www', 2, 10, 1, 1, 2, NULL);

SELECT * FROM eskd;


-- ЕСTД

DESC estd;

INSERT INTO estd (name, filename, eskd_id, tz_estd_id, workers_razr_estd_id, workers_prov_estd_id, workers_utv_estd_id, material_count, metadata) VALUES
  ('55001-04', 'https://www', 1, 3, 10, 1, 1, '2', NULL);

SELECT * FROM estd;

-- Тех операции

DESC tech_op;
SELECT * FROM workplace;

INSERT INTO tech_op (name, estd_id, namber, workplace_id, previous_id, next_id, time_op) VALUES
  ('1сторона', 1, '1', 1, NULL, '2', '0:10:12'),
  ('Проверка', 1, '2', 4, '1', '3', '0:10:12'),
  ('Фрезерная обработка', 1, '3', 3, '2', '4', '0:10:12'),
  ('Проверка', 1, '4', 4, '3', '5', '0:10:12'),
  ('2сторона', 1, '5', 1, '4', NULL, '0:10:12');

SELECT * FROM tech_op;

-- Маршрутный паспорт

DESC mp;
SELECT * FROM status;

INSERT INTO mp (namber_mp, namber_part, specification_id, estd_id, namber_detail, status_id) VALUES
  ('1', '2', 1, 1, 10, 5);

SELECT * FROM mp;

-- Выполнение работы по операциям

DESC mp_tech_op;
SELECT * FROM tech_op WHERE estd_id = (SELECT id FROM estd WHERE name = '55001-04');

INSERT INTO mp_tech_op (mp_id, tech_op_id, workers_id) VALUES
  (1, 1, 5),
  (1, 2, 5),
  (1, 3, 15),
  (1, 4, 5),
  (1, 5, 5);

SELECT * FROM mp_tech_op;


